Brannflakess/CMPE_146_Project/STM32/Core/Src/main.c
    case SQUAT_STATE_BOTTOM:
        if (squat_baseline_init && (delta < (SQUAT_BOTTOM_DELTA / 2.0f)))
        {
            squat_state_hold_count++;
            if (squat_state_hold_count >= MIN_STATE_HOLD)
            {
                squat_state = SQUAT_STATE_GOING_UP;
                squat_state_hold_count = 0;
                printf("SQUAT STATE -> GOING_UP\r\n");
            }
        }
        else
        {
            squat_state_hold_count = 0;
        }
        break;

    case SQUAT_STATE_GOING_UP:
        if (squat_baseline_init && (delta <= (SQUAT_DOWN_DELTA / 2.0f)))
        {
            /* compute ROM and decide whether to count */
            float rom = squat_baseline_ay - squat_min_ay;
            if ((now_ms - squat_last_rep_time) > SQUAT_REP_LOCKOUT_MS)
            {
                if (rom >= SQUAT_MIN_ROM)
                {
                    squat_count++;
                    squat_last_rep_time = now_ms;
                    printf("SQUAT COUNT = %lu (rom=%.0f)\r\n", (unsigned long)squat_count, rom);
                }
                else
                {
                    printf("SQUAT REP REJECTED (rom=%.0f min=%d)\r\n", rom, SQUAT_MIN_ROM);
                }
            }

            squat_state = SQUAT_STATE_STANDING;
            squat_min_ay = 99999.0f;
            squat_state_hold_count = 0;
            printf("SQUAT STATE -> STANDING\r\n");
        }
        break;

    default:
        squat_state = SQUAT_STATE_STANDING;
        squat_state_hold_count = 0;
        break;
    }
}

/* -------------------------------------------------------------------------- */
/* PUSH-UP LOGIC                                                              */
/* -------------------------------------------------------------------------- */
void Pushup_Update(int value, uint32_t now_ms)
{
    switch (pushup_state)
    {
    case PUSHUP_STATE_TOP:
        /* Going down = value becomes LESS negative */
        if (value > PUSHUP_DOWN_THRESHOLD)
        {
            pushup_state = PUSHUP_STATE_GOING_DOWN;
            printf("PUSHUP STATE -> GOING_DOWN\r\n");
        }
        break;

    case PUSHUP_STATE_GOING_DOWN:
        if (value > PUSHUP_BOTTOM_THRESHOLD)
        {
            pushup_state = PUSHUP_STATE_BOTTOM;
            printf("PUSHUP STATE -> BOTTOM\r\n");
        }
        else if (value < PUSHUP_TOP_THRESHOLD)
        {
            /* Went back to top too early */
            pushup_state = PUSHUP_STATE_TOP;
            printf("PUSHUP STATE -> TOP (reset)\r\n");
        }
        break;

    case PUSHUP_STATE_BOTTOM:
        /* Going up = value becomes MORE negative again */
        if (value < PUSHUP_UP_THRESHOLD)
        {
            pushup_state = PUSHUP_STATE_GOING_UP;
            printf("PUSHUP STATE -> GOING_UP\r\n");
        }
        break;

    case PUSHUP_STATE_GOING_UP:
        if (value < PUSHUP_TOP_THRESHOLD)
        {
            if ((now_ms - pushup_last_rep_time) > PUSHUP_REP_LOCKOUT_MS)
            {
                pushup_count++;
                pushup_last_rep_time = now_ms;
                printf("PUSHUP COUNT = %lu\r\n", (unsigned long)pushup_count);
            }

            pushup_state = PUSHUP_STATE_TOP;
            printf("PUSHUP STATE -> TOP\r\n");
        }
        break;

    default:
        pushup_state = PUSHUP_STATE_TOP;
        break;
    }
}

/* -------------------------------------------------------------------------- */
/* STRING HELPERS                                                             */
/* -------------------------------------------------------------------------- */
const char *ExerciseMode_ToString(ExerciseMode mode)
{
    switch (mode)
    {
    case EXERCISE_SQUAT:
        return "SQUAT";
    case EXERCISE_PUSHUP:
        return "PUSHUP";
    default:
        return "UNKNOWN";
    }
}

const char *SquatState_ToString(SquatState state)
{
    switch (state)
    {
    case SQUAT_STATE_STANDING:
        return "STANDING";
    case SQUAT_STATE_GOING_DOWN:
        return "GOING_DOWN";
    case SQUAT_STATE_BOTTOM:
        return "BOTTOM";
    case SQUAT_STATE_GOING_UP:
        return "GOING_UP";
    default:
        return "UNKNOWN";
    }
}

const char *PushupState_ToString(PushupState state)
{
    switch (state)
    {
    case PUSHUP_STATE_TOP:
        return "TOP";
    case PUSHUP_STATE_GOING_DOWN:
        return "GOING_DOWN";
    case PUSHUP_STATE_BOTTOM:
        return "BOTTOM";
    case PUSHUP_STATE_GOING_UP:
        return "GOING_UP";
    default:
        return "UNKNOWN";
    }
}

void OLED_UpdateScreen(void)
{
    char line[24];

    OLED_Clear();

    OLED_WriteLine(0, "Motion Tracker");

    sprintf(line, "Mode: %s", ExerciseMode_ToString(current_mode));
    OLED_WriteLine(2, line);

    sprintf(line, "Squats: %lu", (unsigned long)squat_count);
    OLED_WriteLine(4, line);

    sprintf(line, "Pushups: %lu", (unsigned long)pushup_count);
    OLED_WriteLine(5, line);

    OLED_Display();
}
/* USER CODE END 0 */

/* -------------------------------------------------------------------------- */
/* MAIN                                                                       */
/* -------------------------------------------------------------------------- */
int main(void)
{
    /* USER CODE BEGIN 1 */

    /* USER CODE END 1 */

    HAL_Init();
    SystemClock_Config();

    MX_GPIO_Init();
    MX_I2C1_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();

    /* Quick debug: test UART output */
    printf("Hello STM32 UART - Debug Test\r\n");

    /* USER CODE BEGIN 2 */
    if (MPU6050_Init() != HAL_OK)
    {
        printf("MPU init failed. Stopping.\r\n");
        while (1)
        {
            HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
            HAL_Delay(200);
        }
    }

    OLED_Init(&hi2c1);
    OLED_Clear();
    OLED_WriteLine(0, "Starting...");
    OLED_Display();

    printf("Starting combined squat + push-up detection loop...\r\n");
    printf("Chest-mounted IMU mode detection enabled.\r\n");
    printf("Tune thresholds after first real test.\r\n\r\n");
    /* USER CODE END 2 */

