Brannflakess/CMPE_146_Project/STM32/Core/Src/main.c
    /* USER CODE BEGIN WHILE */
    while (1)
    {
        /* USER CODE END WHILE */

        /* USER CODE BEGIN 3 */
        int16_t ax, ay, az;
        HAL_StatusTypeDef status;

        status = MPU6050_ReadAccelRaw(&ax, &ay, &az);

        if (status == HAL_OK)
        {
            int raw_axis = 0;
            int filtered_axis = 0;
            const char *state_string = "UNKNOWN";
            uint32_t now_ms = HAL_GetTick();
            int ax_g_x100 = (ax * 100) / 16384;
            int ay_g_x100 = (ay * 100) / 16384;
            int az_g_x100 = (az * 100) / 16384;

            ExerciseMode detected_mode = Detect_ExerciseMode(ax, ay, az);
            Update_Mode_Lock(detected_mode, now_ms);

            if (current_mode == EXERCISE_SQUAT)
            {
                raw_axis = ay;
                filtered_axis = MovingAverage_Update(&squat_filter, raw_axis);
                state_string = SquatState_ToString(squat_state);

                Squat_Update(filtered_axis, now_ms);
            }
            else if (current_mode == EXERCISE_PUSHUP)
            {
                raw_axis = az;
                filtered_axis = MovingAverage_Update(&pushup_filter, raw_axis);
                state_string = PushupState_ToString(pushup_state);

                Pushup_Update(filtered_axis, now_ms);
            }
            else
            {
            }
            char json[256];
            sprintf(json, "{\"mode\":\"%s\",\"ax\":%d,\"ay\":%d,\"az\":%d,\"raw\":%d,\"filtered\":%d,\"state\":\"%s\",\"squat_count\":%lu,\"pushup_count\":%lu}\n",
                    ExerciseMode_ToString(current_mode), ax, ay, az, raw_axis, filtered_axis, state_string, (unsigned long)squat_count, (unsigned long)pushup_count);
            printf("%s", json);

            printf("Mode=%s, AX=%d.%02d g, AY=%d.%02d g, AZ=%d.%02d g, Raw=%d, Filtered=%d, State=%s, Squat=%lu, Pushup=%lu\r\n",
                   ExerciseMode_ToString(current_mode),
                   ax_g_x100 / 100, abs(ax_g_x100 % 100),
                   ay_g_x100 / 100, abs(ay_g_x100 % 100),
                   az_g_x100 / 100, abs(az_g_x100 % 100),
                   raw_axis,
                   filtered_axis,
                   state_string,
                   (unsigned long)squat_count,
                   (unsigned long)pushup_count);

            if ((now_ms - last_esp32_tx) >= ESP32_TX_PERIOD_MS)
            {
                if (ESP32_SendTelemetry(ax, ay, az, raw_axis, filtered_axis, state_string, now_ms) == HAL_OK)
                {
                    last_esp32_tx = now_ms;
                }
            }
        }
        else
        {
            printf("Accel read failed\r\n");
        }

        if (status == HAL_OK)
        {
            if (HAL_GetTick() - last_oled_update >= 300)
            {
                OLED_UpdateScreen();
                last_oled_update = HAL_GetTick();
            }
        }

        HAL_Delay(SAMPLE_DELAY_MS);
    }
    /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief I2C1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_I2C1_Init(void)
{
    hi2c1.Instance = I2C1;
    hi2c1.Init.ClockSpeed = 100000;
    hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
    hi2c1.Init.OwnAddress1 = 0;
    hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c1.Init.OwnAddress2 = 0;
    hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;

    if (HAL_I2C_Init(&hi2c1) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief USART1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_USART1_UART_Init(void)
{
    huart1.Instance = USART1;
    huart1.Init.BaudRate = 115200;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;

    if (HAL_UART_Init(&huart1) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief USART2 Initialization Function
 * @param None
 * @retval None
 */
static void MX_USART2_UART_Init(void)
{
    huart2.Instance = USART2;
    huart2.Init.BaudRate = 115200;
    huart2.Init.WordLength = UART_WORDLENGTH_8B;
    huart2.Init.StopBits = UART_STOPBITS_1;
    huart2.Init.Parity = UART_PARITY_NONE;
    huart2.Init.Mode = UART_MODE_TX_RX;
    huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart2.Init.OverSampling = UART_OVERSAMPLING_16;

    if (HAL_UART_Init(&huart2) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief GPIO Initialization Function
 * @param None
 * @retval None
 */
static void MX_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);

    GPIO_InitStruct.Pin = GPIO_PIN_5;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
    __disable_irq();
    while (1)
    {
    }
}

#ifdef USE_FULL_ASSERT
void assert_failed(uint8_t *file, uint32_t line)
{
    /* USER CODE BEGIN 6 */
    /* USER CODE END 6 */
}
#endif